app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-08-19 06:30:44.069030"], ["updated_at", "2016-08-19 06:30:44.069030"]]
---
  def create
    @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-08-19 06:30:47.121882"], ["id", 1]]
---
  def update
    @student.update(params.require(:student).permit(:first_name, :last_name))